MikroElektronika/core_packages/PIC/XC8/def/PIC18F24Q10/mcu.h
extern volatile CWG1INPPSbits_t CWG1INPPSbits __at(0xEAC);
// bitfield macros
#define _CWG1INPPS_PIN_POSN                                 0x0
#define _CWG1INPPS_PIN_POSITION                             0x0
#define _CWG1INPPS_PIN_SIZE                                 0x3
#define _CWG1INPPS_PIN_LENGTH                               0x3
#define _CWG1INPPS_PIN_MASK                                 0x7
#define _CWG1INPPS_PORT_POSN                                0x3
#define _CWG1INPPS_PORT_POSITION                            0x3
#define _CWG1INPPS_PORT_SIZE                                0x2
#define _CWG1INPPS_PORT_LENGTH                              0x2
#define _CWG1INPPS_PORT_MASK                                0x18
#define _CWG1INPPS_CWGINPPS0_POSN                           0x0
#define _CWG1INPPS_CWGINPPS0_POSITION                       0x0
#define _CWG1INPPS_CWGINPPS0_SIZE                           0x1
#define _CWG1INPPS_CWGINPPS0_LENGTH                         0x1
#define _CWG1INPPS_CWGINPPS0_MASK                           0x1
#define _CWG1INPPS_CWGINPPS1_POSN                           0x1
#define _CWG1INPPS_CWGINPPS1_POSITION                       0x1
#define _CWG1INPPS_CWGINPPS1_SIZE                           0x1
#define _CWG1INPPS_CWGINPPS1_LENGTH                         0x1
#define _CWG1INPPS_CWGINPPS1_MASK                           0x2
#define _CWG1INPPS_CWGINPPS2_POSN                           0x2
#define _CWG1INPPS_CWGINPPS2_POSITION                       0x2
#define _CWG1INPPS_CWGINPPS2_SIZE                           0x1
#define _CWG1INPPS_CWGINPPS2_LENGTH                         0x1
#define _CWG1INPPS_CWGINPPS2_MASK                           0x4
#define _CWG1INPPS_CWGINPPS3_POSN                           0x3
#define _CWG1INPPS_CWGINPPS3_POSITION                       0x3
#define _CWG1INPPS_CWGINPPS3_SIZE                           0x1
#define _CWG1INPPS_CWGINPPS3_LENGTH                         0x1
#define _CWG1INPPS_CWGINPPS3_MASK                           0x8
#define _CWG1INPPS_CWGINPPS4_POSN                           0x4
#define _CWG1INPPS_CWGINPPS4_POSITION                       0x4
#define _CWG1INPPS_CWGINPPS4_SIZE                           0x1
#define _CWG1INPPS_CWGINPPS4_LENGTH                         0x1
#define _CWG1INPPS_CWGINPPS4_MASK                           0x10
#define _CWG1INPPS_CWG1INPPS_POSN                           0x0
#define _CWG1INPPS_CWG1INPPS_POSITION                       0x0
#define _CWG1INPPS_CWG1INPPS_SIZE                           0x5
#define _CWG1INPPS_CWG1INPPS_LENGTH                         0x5
#define _CWG1INPPS_CWG1INPPS_MASK                           0x1F
#define _CWG1INPPS_CWG1INPPS0_POSN                          0x0
#define _CWG1INPPS_CWG1INPPS0_POSITION                      0x0
#define _CWG1INPPS_CWG1INPPS0_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS0_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS0_MASK                          0x1
#define _CWG1INPPS_CWG1INPPS1_POSN                          0x1
#define _CWG1INPPS_CWG1INPPS1_POSITION                      0x1
#define _CWG1INPPS_CWG1INPPS1_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS1_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS1_MASK                          0x2
#define _CWG1INPPS_CWG1INPPS2_POSN                          0x2
#define _CWG1INPPS_CWG1INPPS2_POSITION                      0x2
#define _CWG1INPPS_CWG1INPPS2_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS2_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS2_MASK                          0x4
#define _CWG1INPPS_CWG1INPPS3_POSN                          0x3
#define _CWG1INPPS_CWG1INPPS3_POSITION                      0x3
#define _CWG1INPPS_CWG1INPPS3_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS3_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS3_MASK                          0x8
#define _CWG1INPPS_CWG1INPPS4_POSN                          0x4
#define _CWG1INPPS_CWG1INPPS4_POSITION                      0x4
#define _CWG1INPPS_CWG1INPPS4_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS4_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS4_MASK                          0x10
#define _CWG1INPPS_CWGINPPS_POSN                            0x0
#define _CWG1INPPS_CWGINPPS_POSITION                        0x0
#define _CWG1INPPS_CWGINPPS_SIZE                            0x5
#define _CWG1INPPS_CWGINPPS_LENGTH                          0x5
#define _CWG1INPPS_CWGINPPS_MASK                            0x1F

// Register: MDCARLPPS
#define MDCARLPPS MDCARLPPS
extern volatile unsigned char           MDCARLPPS           __at(0xEAD);
#ifndef _LIB_BUILD
asm("MDCARLPPS equ 0EADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned MDCARLPPS0             :1;
        unsigned MDCARLPPS1             :1;
        unsigned MDCARLPPS2             :1;
        unsigned MDCARLPPS3             :1;
        unsigned MDCARLPPS4             :1;
    };
    struct {
        unsigned MDCARLPPS              :5;
    };
} MDCARLPPSbits_t;
extern volatile MDCARLPPSbits_t MDCARLPPSbits __at(0xEAD);
// bitfield macros
#define _MDCARLPPS_PIN_POSN                                 0x0
#define _MDCARLPPS_PIN_POSITION                             0x0
#define _MDCARLPPS_PIN_SIZE                                 0x3
#define _MDCARLPPS_PIN_LENGTH                               0x3
#define _MDCARLPPS_PIN_MASK                                 0x7
#define _MDCARLPPS_PORT_POSN                                0x3
#define _MDCARLPPS_PORT_POSITION                            0x3
#define _MDCARLPPS_PORT_SIZE                                0x2
#define _MDCARLPPS_PORT_LENGTH                              0x2
#define _MDCARLPPS_PORT_MASK                                0x18
#define _MDCARLPPS_MDCARLPPS0_POSN                          0x0
#define _MDCARLPPS_MDCARLPPS0_POSITION                      0x0
#define _MDCARLPPS_MDCARLPPS0_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS0_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS0_MASK                          0x1
#define _MDCARLPPS_MDCARLPPS1_POSN                          0x1
#define _MDCARLPPS_MDCARLPPS1_POSITION                      0x1
#define _MDCARLPPS_MDCARLPPS1_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS1_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS1_MASK                          0x2
#define _MDCARLPPS_MDCARLPPS2_POSN                          0x2
#define _MDCARLPPS_MDCARLPPS2_POSITION                      0x2
#define _MDCARLPPS_MDCARLPPS2_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS2_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS2_MASK                          0x4
#define _MDCARLPPS_MDCARLPPS3_POSN                          0x3
#define _MDCARLPPS_MDCARLPPS3_POSITION                      0x3
#define _MDCARLPPS_MDCARLPPS3_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS3_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS3_MASK                          0x8
#define _MDCARLPPS_MDCARLPPS4_POSN                          0x4
#define _MDCARLPPS_MDCARLPPS4_POSITION                      0x4
#define _MDCARLPPS_MDCARLPPS4_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS4_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS4_MASK                          0x10
#define _MDCARLPPS_MDCARLPPS_POSN                           0x0
#define _MDCARLPPS_MDCARLPPS_POSITION                       0x0
#define _MDCARLPPS_MDCARLPPS_SIZE                           0x5
#define _MDCARLPPS_MDCARLPPS_LENGTH                         0x5
#define _MDCARLPPS_MDCARLPPS_MASK                           0x1F

// Register: MDCARHPPS
#define MDCARHPPS MDCARHPPS
extern volatile unsigned char           MDCARHPPS           __at(0xEAE);
#ifndef _LIB_BUILD
asm("MDCARHPPS equ 0EAEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned MDCARHPPS0             :1;
        unsigned MDCARHPPS1             :1;
        unsigned MDCARHPPS2             :1;
        unsigned MDCARHPPS3             :1;
        unsigned MDCARHPPS4             :1;
    };
    struct {
        unsigned MDCARHPPS              :5;
    };
} MDCARHPPSbits_t;
