MikroElektronika/core_packages/PIC/XC8/def/PIC18F24Q10/mcu.h
// Register: TMR3H
#define TMR3H TMR3H
extern volatile unsigned char           TMR3H               __at(0xFC7);
#ifndef _LIB_BUILD
asm("TMR3H equ 0FC7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR3H                  :8;
    };
    struct {
        unsigned TMR3H0                 :1;
        unsigned TMR3H1                 :1;
        unsigned TMR3H2                 :1;
        unsigned TMR3H3                 :1;
        unsigned TMR3H4                 :1;
        unsigned TMR3H5                 :1;
        unsigned TMR3H6                 :1;
        unsigned TMR3H7                 :1;
    };
    struct {
        unsigned TMR38                  :1;
        unsigned TMR39                  :1;
        unsigned TMR310                 :1;
        unsigned TMR311                 :1;
        unsigned TMR312                 :1;
        unsigned TMR313                 :1;
        unsigned TMR314                 :1;
        unsigned TMR315                 :1;
    };
} TMR3Hbits_t;
extern volatile TMR3Hbits_t TMR3Hbits __at(0xFC7);
// bitfield macros
#define _TMR3H_TMR3H_POSN                                   0x0
#define _TMR3H_TMR3H_POSITION                               0x0
#define _TMR3H_TMR3H_SIZE                                   0x8
#define _TMR3H_TMR3H_LENGTH                                 0x8
#define _TMR3H_TMR3H_MASK                                   0xFF
#define _TMR3H_TMR3H0_POSN                                  0x0
#define _TMR3H_TMR3H0_POSITION                              0x0
#define _TMR3H_TMR3H0_SIZE                                  0x1
#define _TMR3H_TMR3H0_LENGTH                                0x1
#define _TMR3H_TMR3H0_MASK                                  0x1
#define _TMR3H_TMR3H1_POSN                                  0x1
#define _TMR3H_TMR3H1_POSITION                              0x1
#define _TMR3H_TMR3H1_SIZE                                  0x1
#define _TMR3H_TMR3H1_LENGTH                                0x1
#define _TMR3H_TMR3H1_MASK                                  0x2
#define _TMR3H_TMR3H2_POSN                                  0x2
#define _TMR3H_TMR3H2_POSITION                              0x2
#define _TMR3H_TMR3H2_SIZE                                  0x1
#define _TMR3H_TMR3H2_LENGTH                                0x1
#define _TMR3H_TMR3H2_MASK                                  0x4
#define _TMR3H_TMR3H3_POSN                                  0x3
#define _TMR3H_TMR3H3_POSITION                              0x3
#define _TMR3H_TMR3H3_SIZE                                  0x1
#define _TMR3H_TMR3H3_LENGTH                                0x1
#define _TMR3H_TMR3H3_MASK                                  0x8
#define _TMR3H_TMR3H4_POSN                                  0x4
#define _TMR3H_TMR3H4_POSITION                              0x4
#define _TMR3H_TMR3H4_SIZE                                  0x1
#define _TMR3H_TMR3H4_LENGTH                                0x1
#define _TMR3H_TMR3H4_MASK                                  0x10
#define _TMR3H_TMR3H5_POSN                                  0x5
#define _TMR3H_TMR3H5_POSITION                              0x5
#define _TMR3H_TMR3H5_SIZE                                  0x1
#define _TMR3H_TMR3H5_LENGTH                                0x1
#define _TMR3H_TMR3H5_MASK                                  0x20
#define _TMR3H_TMR3H6_POSN                                  0x6
#define _TMR3H_TMR3H6_POSITION                              0x6
#define _TMR3H_TMR3H6_SIZE                                  0x1
#define _TMR3H_TMR3H6_LENGTH                                0x1
#define _TMR3H_TMR3H6_MASK                                  0x40
#define _TMR3H_TMR3H7_POSN                                  0x7
#define _TMR3H_TMR3H7_POSITION                              0x7
#define _TMR3H_TMR3H7_SIZE                                  0x1
#define _TMR3H_TMR3H7_LENGTH                                0x1
#define _TMR3H_TMR3H7_MASK                                  0x80
#define _TMR3H_TMR38_POSN                                   0x0
#define _TMR3H_TMR38_POSITION                               0x0
#define _TMR3H_TMR38_SIZE                                   0x1
#define _TMR3H_TMR38_LENGTH                                 0x1
#define _TMR3H_TMR38_MASK                                   0x1
#define _TMR3H_TMR39_POSN                                   0x1
#define _TMR3H_TMR39_POSITION                               0x1
#define _TMR3H_TMR39_SIZE                                   0x1
#define _TMR3H_TMR39_LENGTH                                 0x1
#define _TMR3H_TMR39_MASK                                   0x2
#define _TMR3H_TMR310_POSN                                  0x2
#define _TMR3H_TMR310_POSITION                              0x2
#define _TMR3H_TMR310_SIZE                                  0x1
#define _TMR3H_TMR310_LENGTH                                0x1
#define _TMR3H_TMR310_MASK                                  0x4
#define _TMR3H_TMR311_POSN                                  0x3
#define _TMR3H_TMR311_POSITION                              0x3
#define _TMR3H_TMR311_SIZE                                  0x1
#define _TMR3H_TMR311_LENGTH                                0x1
#define _TMR3H_TMR311_MASK                                  0x8
#define _TMR3H_TMR312_POSN                                  0x4
#define _TMR3H_TMR312_POSITION                              0x4
#define _TMR3H_TMR312_SIZE                                  0x1
#define _TMR3H_TMR312_LENGTH                                0x1
#define _TMR3H_TMR312_MASK                                  0x10
#define _TMR3H_TMR313_POSN                                  0x5
#define _TMR3H_TMR313_POSITION                              0x5
#define _TMR3H_TMR313_SIZE                                  0x1
#define _TMR3H_TMR313_LENGTH                                0x1
#define _TMR3H_TMR313_MASK                                  0x20
#define _TMR3H_TMR314_POSN                                  0x6
#define _TMR3H_TMR314_POSITION                              0x6
#define _TMR3H_TMR314_SIZE                                  0x1
#define _TMR3H_TMR314_LENGTH                                0x1
#define _TMR3H_TMR314_MASK                                  0x40
#define _TMR3H_TMR315_POSN                                  0x7
#define _TMR3H_TMR315_POSITION                              0x7
#define _TMR3H_TMR315_SIZE                                  0x1
#define _TMR3H_TMR315_LENGTH                                0x1
#define _TMR3H_TMR315_MASK                                  0x80

// Register: T3CON
#define T3CON T3CON
extern volatile unsigned char           T3CON               __at(0xFC8);
#ifndef _LIB_BUILD
asm("T3CON equ 0FC8h");
#endif
// aliases
extern volatile unsigned char           TMR3CON             __at(0xFC8);
#ifndef _LIB_BUILD
asm("TMR3CON equ 0FC8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ON                     :1;
        unsigned RD16                   :1;
        unsigned NOT_SYNC               :1;
        unsigned                        :1;
        unsigned CKPS                   :2;
    };
    struct {
        unsigned TMR3ON                 :1;
        unsigned T3RD16                 :1;
        unsigned NOT_T3SYNC             :1;
        unsigned                        :1;
        unsigned T3CKPS0                :1;
        unsigned T3CKPS1                :1;
    };
    struct {
        unsigned                        :2;
        unsigned nSYNC                  :1;
        unsigned                        :1;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned RD163                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned nT3SYNC                :1;
    };
} T3CONbits_t;
extern volatile T3CONbits_t T3CONbits __at(0xFC8);
// bitfield macros
#define _T3CON_ON_POSN                                      0x0
#define _T3CON_ON_POSITION                                  0x0
#define _T3CON_ON_SIZE                                      0x1
#define _T3CON_ON_LENGTH                                    0x1
#define _T3CON_ON_MASK                                      0x1
#define _T3CON_RD16_POSN                                    0x1
#define _T3CON_RD16_POSITION                                0x1
#define _T3CON_RD16_SIZE                                    0x1
#define _T3CON_RD16_LENGTH                                  0x1
#define _T3CON_RD16_MASK                                    0x2
#define _T3CON_NOT_SYNC_POSN                                0x2
#define _T3CON_NOT_SYNC_POSITION                            0x2
#define _T3CON_NOT_SYNC_SIZE                                0x1
#define _T3CON_NOT_SYNC_LENGTH                              0x1
#define _T3CON_NOT_SYNC_MASK                                0x4
#define _T3CON_CKPS_POSN                                    0x4
#define _T3CON_CKPS_POSITION                                0x4
#define _T3CON_CKPS_SIZE                                    0x2
#define _T3CON_CKPS_LENGTH                                  0x2
#define _T3CON_CKPS_MASK                                    0x30
#define _T3CON_TMR3ON_POSN                                  0x0
#define _T3CON_TMR3ON_POSITION                              0x0
#define _T3CON_TMR3ON_SIZE                                  0x1
#define _T3CON_TMR3ON_LENGTH                                0x1
#define _T3CON_TMR3ON_MASK                                  0x1
#define _T3CON_T3RD16_POSN                                  0x1
#define _T3CON_T3RD16_POSITION                              0x1
#define _T3CON_T3RD16_SIZE                                  0x1
#define _T3CON_T3RD16_LENGTH                                0x1
#define _T3CON_T3RD16_MASK                                  0x2
#define _T3CON_NOT_T3SYNC_POSN                              0x2
#define _T3CON_NOT_T3SYNC_POSITION                          0x2
#define _T3CON_NOT_T3SYNC_SIZE                              0x1
#define _T3CON_NOT_T3SYNC_LENGTH                            0x1
#define _T3CON_NOT_T3SYNC_MASK                              0x4
#define _T3CON_T3CKPS0_POSN                                 0x4
#define _T3CON_T3CKPS0_POSITION                             0x4
#define _T3CON_T3CKPS0_SIZE                                 0x1
#define _T3CON_T3CKPS0_LENGTH                               0x1
#define _T3CON_T3CKPS0_MASK                                 0x10
#define _T3CON_T3CKPS1_POSN                                 0x5
#define _T3CON_T3CKPS1_POSITION                             0x5
#define _T3CON_T3CKPS1_SIZE                                 0x1
#define _T3CON_T3CKPS1_LENGTH                               0x1
#define _T3CON_T3CKPS1_MASK                                 0x20
#define _T3CON_nSYNC_POSN                                   0x2
#define _T3CON_nSYNC_POSITION                               0x2
#define _T3CON_nSYNC_SIZE                                   0x1
#define _T3CON_nSYNC_LENGTH                                 0x1
#define _T3CON_nSYNC_MASK                                   0x4
#define _T3CON_CKPS0_POSN                                   0x4
#define _T3CON_CKPS0_POSITION                               0x4
#define _T3CON_CKPS0_SIZE                                   0x1
#define _T3CON_CKPS0_LENGTH                                 0x1
#define _T3CON_CKPS0_MASK                                   0x10
#define _T3CON_CKPS1_POSN                                   0x5
#define _T3CON_CKPS1_POSITION                               0x5
#define _T3CON_CKPS1_SIZE                                   0x1
#define _T3CON_CKPS1_LENGTH                                 0x1
#define _T3CON_CKPS1_MASK                                   0x20
#define _T3CON_RD163_POSN                                   0x1
#define _T3CON_RD163_POSITION                               0x1
#define _T3CON_RD163_SIZE                                   0x1
#define _T3CON_RD163_LENGTH                                 0x1
#define _T3CON_RD163_MASK                                   0x2
#define _T3CON_nT3SYNC_POSN                                 0x2
#define _T3CON_nT3SYNC_POSITION                             0x2
#define _T3CON_nT3SYNC_SIZE                                 0x1
#define _T3CON_nT3SYNC_LENGTH                               0x1
#define _T3CON_nT3SYNC_MASK                                 0x4
// alias bitfield definitions
typedef union {
    struct {
        unsigned ON                     :1;
        unsigned RD16                   :1;
        unsigned NOT_SYNC               :1;
        unsigned                        :1;
        unsigned CKPS                   :2;
    };
    struct {
        unsigned TMR3ON                 :1;
        unsigned T3RD16                 :1;
        unsigned NOT_T3SYNC             :1;
        unsigned                        :1;
        unsigned T3CKPS0                :1;
        unsigned T3CKPS1                :1;
    };
    struct {
        unsigned                        :2;
        unsigned nSYNC                  :1;
        unsigned                        :1;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned RD163                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned nT3SYNC                :1;
    };
} TMR3CONbits_t;
extern volatile TMR3CONbits_t TMR3CONbits __at(0xFC8);
// bitfield macros
#define _TMR3CON_ON_POSN                                    0x0
#define _TMR3CON_ON_POSITION                                0x0
#define _TMR3CON_ON_SIZE                                    0x1
#define _TMR3CON_ON_LENGTH                                  0x1
#define _TMR3CON_ON_MASK                                    0x1
#define _TMR3CON_RD16_POSN                                  0x1
#define _TMR3CON_RD16_POSITION                              0x1
#define _TMR3CON_RD16_SIZE                                  0x1
#define _TMR3CON_RD16_LENGTH                                0x1
#define _TMR3CON_RD16_MASK                                  0x2
#define _TMR3CON_NOT_SYNC_POSN                              0x2
#define _TMR3CON_NOT_SYNC_POSITION                          0x2
#define _TMR3CON_NOT_SYNC_SIZE                              0x1
#define _TMR3CON_NOT_SYNC_LENGTH                            0x1
#define _TMR3CON_NOT_SYNC_MASK                              0x4
#define _TMR3CON_CKPS_POSN                                  0x4
#define _TMR3CON_CKPS_POSITION                              0x4
#define _TMR3CON_CKPS_SIZE                                  0x2
#define _TMR3CON_CKPS_LENGTH                                0x2
#define _TMR3CON_CKPS_MASK                                  0x30
#define _TMR3CON_TMR3ON_POSN                                0x0
#define _TMR3CON_TMR3ON_POSITION                            0x0
#define _TMR3CON_TMR3ON_SIZE                                0x1
#define _TMR3CON_TMR3ON_LENGTH                              0x1
#define _TMR3CON_TMR3ON_MASK                                0x1
#define _TMR3CON_T3RD16_POSN                                0x1
#define _TMR3CON_T3RD16_POSITION                            0x1
#define _TMR3CON_T3RD16_SIZE                                0x1
#define _TMR3CON_T3RD16_LENGTH                              0x1
#define _TMR3CON_T3RD16_MASK                                0x2
#define _TMR3CON_NOT_T3SYNC_POSN                            0x2
#define _TMR3CON_NOT_T3SYNC_POSITION                        0x2
#define _TMR3CON_NOT_T3SYNC_SIZE                            0x1
#define _TMR3CON_NOT_T3SYNC_LENGTH                          0x1
#define _TMR3CON_NOT_T3SYNC_MASK                            0x4
#define _TMR3CON_T3CKPS0_POSN                               0x4
#define _TMR3CON_T3CKPS0_POSITION                           0x4
#define _TMR3CON_T3CKPS0_SIZE                               0x1
#define _TMR3CON_T3CKPS0_LENGTH                             0x1
#define _TMR3CON_T3CKPS0_MASK                               0x10
#define _TMR3CON_T3CKPS1_POSN                               0x5
#define _TMR3CON_T3CKPS1_POSITION                           0x5
#define _TMR3CON_T3CKPS1_SIZE                               0x1
#define _TMR3CON_T3CKPS1_LENGTH                             0x1
#define _TMR3CON_T3CKPS1_MASK                               0x20
#define _TMR3CON_nSYNC_POSN                                 0x2
#define _TMR3CON_nSYNC_POSITION                             0x2
#define _TMR3CON_nSYNC_SIZE                                 0x1
#define _TMR3CON_nSYNC_LENGTH                               0x1
#define _TMR3CON_nSYNC_MASK                                 0x4
#define _TMR3CON_CKPS0_POSN                                 0x4
#define _TMR3CON_CKPS0_POSITION                             0x4
#define _TMR3CON_CKPS0_SIZE                                 0x1
#define _TMR3CON_CKPS0_LENGTH                               0x1
#define _TMR3CON_CKPS0_MASK                                 0x10
#define _TMR3CON_CKPS1_POSN                                 0x5
#define _TMR3CON_CKPS1_POSITION                             0x5
#define _TMR3CON_CKPS1_SIZE                                 0x1
#define _TMR3CON_CKPS1_LENGTH                               0x1
#define _TMR3CON_CKPS1_MASK                                 0x20
#define _TMR3CON_RD163_POSN                                 0x1
#define _TMR3CON_RD163_POSITION                             0x1
#define _TMR3CON_RD163_SIZE                                 0x1
#define _TMR3CON_RD163_LENGTH                               0x1
#define _TMR3CON_RD163_MASK                                 0x2
#define _TMR3CON_nT3SYNC_POSN                               0x2
#define _TMR3CON_nT3SYNC_POSITION                           0x2
#define _TMR3CON_nT3SYNC_SIZE                               0x1
#define _TMR3CON_nT3SYNC_LENGTH                             0x1
#define _TMR3CON_nT3SYNC_MASK                               0x4

// Register: T3GCON
#define T3GCON T3GCON
extern volatile unsigned char           T3GCON              __at(0xFC9);
#ifndef _LIB_BUILD
asm("T3GCON equ 0FC9h");
#endif
// aliases
extern volatile unsigned char           TMR3GCON            __at(0xFC9);
#ifndef _LIB_BUILD
asm("TMR3GCON equ 0FC9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO                    :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned T3GVAL                 :1;
        unsigned T3GGO                  :1;
        unsigned T3GSPM                 :1;
        unsigned T3GTM                  :1;
        unsigned T3GPOL                 :1;
        unsigned T3GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_DONE               :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_T3DONE             :1;
    };
    struct {
        unsigned                        :3;
        unsigned GGO_NOT_DONE           :1;
    };
    struct {
        unsigned                        :3;
        unsigned GGO_nDONE              :1;
    };
    struct {
        unsigned                        :3;
        unsigned T3GGO_NOT_DONE         :1;
    };
    struct {
        unsigned                        :3;
        unsigned T3GGO_nDONE            :1;
    };
} T3GCONbits_t;
