MikroElektronika/core_packages/PIC/XC8/def/PIC18F24Q10/mcu.h
// Register: T1CLK
#define T1CLK T1CLK
extern volatile unsigned char           T1CLK               __at(0xFD1);
#ifndef _LIB_BUILD
asm("T1CLK equ 0FD1h");
#endif
// aliases
extern volatile unsigned char           TMR1CLK             __at(0xFD1);
#ifndef _LIB_BUILD
asm("TMR1CLK equ 0FD1h");
#endif
extern volatile unsigned char           _PR1                 __at(0xFD1);  // Note: Changed by MikroE
#ifndef _LIB_BUILD
asm("_PR1 equ 0FD1h");  // Note: Changed by MikroE
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T1CS0                  :1;
        unsigned T1CS1                  :1;
        unsigned T1CS2                  :1;
        unsigned T1CS3                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
    };
} T1CLKbits_t;
extern volatile T1CLKbits_t T1CLKbits __at(0xFD1);
// bitfield macros
#define _T1CLK_CS_POSN                                      0x0
#define _T1CLK_CS_POSITION                                  0x0
#define _T1CLK_CS_SIZE                                      0x8
#define _T1CLK_CS_LENGTH                                    0x8
#define _T1CLK_CS_MASK                                      0xFF
#define _T1CLK_T1CS0_POSN                                   0x0
#define _T1CLK_T1CS0_POSITION                               0x0
#define _T1CLK_T1CS0_SIZE                                   0x1
#define _T1CLK_T1CS0_LENGTH                                 0x1
#define _T1CLK_T1CS0_MASK                                   0x1
#define _T1CLK_T1CS1_POSN                                   0x1
#define _T1CLK_T1CS1_POSITION                               0x1
#define _T1CLK_T1CS1_SIZE                                   0x1
#define _T1CLK_T1CS1_LENGTH                                 0x1
#define _T1CLK_T1CS1_MASK                                   0x2
#define _T1CLK_T1CS2_POSN                                   0x2
#define _T1CLK_T1CS2_POSITION                               0x2
#define _T1CLK_T1CS2_SIZE                                   0x1
#define _T1CLK_T1CS2_LENGTH                                 0x1
#define _T1CLK_T1CS2_MASK                                   0x4
#define _T1CLK_T1CS3_POSN                                   0x3
#define _T1CLK_T1CS3_POSITION                               0x3
#define _T1CLK_T1CS3_SIZE                                   0x1
#define _T1CLK_T1CS3_LENGTH                                 0x1
#define _T1CLK_T1CS3_MASK                                   0x8
#define _T1CLK_CS0_POSN                                     0x0
#define _T1CLK_CS0_POSITION                                 0x0
#define _T1CLK_CS0_SIZE                                     0x1
#define _T1CLK_CS0_LENGTH                                   0x1
#define _T1CLK_CS0_MASK                                     0x1
#define _T1CLK_CS1_POSN                                     0x1
#define _T1CLK_CS1_POSITION                                 0x1
#define _T1CLK_CS1_SIZE                                     0x1
#define _T1CLK_CS1_LENGTH                                   0x1
#define _T1CLK_CS1_MASK                                     0x2
#define _T1CLK_CS2_POSN                                     0x2
#define _T1CLK_CS2_POSITION                                 0x2
#define _T1CLK_CS2_SIZE                                     0x1
#define _T1CLK_CS2_LENGTH                                   0x1
#define _T1CLK_CS2_MASK                                     0x4
#define _T1CLK_CS3_POSN                                     0x3
#define _T1CLK_CS3_POSITION                                 0x3
#define _T1CLK_CS3_SIZE                                     0x1
#define _T1CLK_CS3_LENGTH                                   0x1
#define _T1CLK_CS3_MASK                                     0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T1CS0                  :1;
        unsigned T1CS1                  :1;
        unsigned T1CS2                  :1;
        unsigned T1CS3                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
    };
} TMR1CLKbits_t;
extern volatile TMR1CLKbits_t TMR1CLKbits __at(0xFD1);
// bitfield macros
#define _TMR1CLK_CS_POSN                                    0x0
#define _TMR1CLK_CS_POSITION                                0x0
#define _TMR1CLK_CS_SIZE                                    0x8
#define _TMR1CLK_CS_LENGTH                                  0x8
#define _TMR1CLK_CS_MASK                                    0xFF
#define _TMR1CLK_T1CS0_POSN                                 0x0
#define _TMR1CLK_T1CS0_POSITION                             0x0
#define _TMR1CLK_T1CS0_SIZE                                 0x1
#define _TMR1CLK_T1CS0_LENGTH                               0x1
#define _TMR1CLK_T1CS0_MASK                                 0x1
#define _TMR1CLK_T1CS1_POSN                                 0x1
#define _TMR1CLK_T1CS1_POSITION                             0x1
#define _TMR1CLK_T1CS1_SIZE                                 0x1
#define _TMR1CLK_T1CS1_LENGTH                               0x1
#define _TMR1CLK_T1CS1_MASK                                 0x2
#define _TMR1CLK_T1CS2_POSN                                 0x2
#define _TMR1CLK_T1CS2_POSITION                             0x2
#define _TMR1CLK_T1CS2_SIZE                                 0x1
#define _TMR1CLK_T1CS2_LENGTH                               0x1
#define _TMR1CLK_T1CS2_MASK                                 0x4
#define _TMR1CLK_T1CS3_POSN                                 0x3
#define _TMR1CLK_T1CS3_POSITION                             0x3
#define _TMR1CLK_T1CS3_SIZE                                 0x1
#define _TMR1CLK_T1CS3_LENGTH                               0x1
#define _TMR1CLK_T1CS3_MASK                                 0x8
#define _TMR1CLK_CS0_POSN                                   0x0
#define _TMR1CLK_CS0_POSITION                               0x0
#define _TMR1CLK_CS0_SIZE                                   0x1
#define _TMR1CLK_CS0_LENGTH                                 0x1
#define _TMR1CLK_CS0_MASK                                   0x1
#define _TMR1CLK_CS1_POSN                                   0x1
#define _TMR1CLK_CS1_POSITION                               0x1
#define _TMR1CLK_CS1_SIZE                                   0x1
#define _TMR1CLK_CS1_LENGTH                                 0x1
#define _TMR1CLK_CS1_MASK                                   0x2
#define _TMR1CLK_CS2_POSN                                   0x2
#define _TMR1CLK_CS2_POSITION                               0x2
#define _TMR1CLK_CS2_SIZE                                   0x1
#define _TMR1CLK_CS2_LENGTH                                 0x1
#define _TMR1CLK_CS2_MASK                                   0x4
#define _TMR1CLK_CS3_POSN                                   0x3
#define _TMR1CLK_CS3_POSITION                               0x3
#define _TMR1CLK_CS3_SIZE                                   0x1
#define _TMR1CLK_CS3_LENGTH                                 0x1
#define _TMR1CLK_CS3_MASK                                   0x8
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T1CS0                  :1;
        unsigned T1CS1                  :1;
        unsigned T1CS2                  :1;
        unsigned T1CS3                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
    };
} PR1bits_t;
extern volatile PR1bits_t PR1bits __at(0xFD1);
// bitfield macros
#define _PR1_CS_POSN                                        0x0
#define _PR1_CS_POSITION                                    0x0
#define _PR1_CS_SIZE                                        0x8
#define _PR1_CS_LENGTH                                      0x8
#define _PR1_CS_MASK                                        0xFF
#define _PR1_T1CS0_POSN                                     0x0
#define _PR1_T1CS0_POSITION                                 0x0
#define _PR1_T1CS0_SIZE                                     0x1
#define _PR1_T1CS0_LENGTH                                   0x1
#define _PR1_T1CS0_MASK                                     0x1
#define _PR1_T1CS1_POSN                                     0x1
#define _PR1_T1CS1_POSITION                                 0x1
#define _PR1_T1CS1_SIZE                                     0x1
#define _PR1_T1CS1_LENGTH                                   0x1
#define _PR1_T1CS1_MASK                                     0x2
#define _PR1_T1CS2_POSN                                     0x2
#define _PR1_T1CS2_POSITION                                 0x2
#define _PR1_T1CS2_SIZE                                     0x1
#define _PR1_T1CS2_LENGTH                                   0x1
#define _PR1_T1CS2_MASK                                     0x4
#define _PR1_T1CS3_POSN                                     0x3
#define _PR1_T1CS3_POSITION                                 0x3
#define _PR1_T1CS3_SIZE                                     0x1
#define _PR1_T1CS3_LENGTH                                   0x1
#define _PR1_T1CS3_MASK                                     0x8
#define _PR1_CS0_POSN                                       0x0
#define _PR1_CS0_POSITION                                   0x0
#define _PR1_CS0_SIZE                                       0x1
#define _PR1_CS0_LENGTH                                     0x1
#define _PR1_CS0_MASK                                       0x1
#define _PR1_CS1_POSN                                       0x1
#define _PR1_CS1_POSITION                                   0x1
#define _PR1_CS1_SIZE                                       0x1
#define _PR1_CS1_LENGTH                                     0x1
#define _PR1_CS1_MASK                                       0x2
#define _PR1_CS2_POSN                                       0x2
#define _PR1_CS2_POSITION                                   0x2
#define _PR1_CS2_SIZE                                       0x1
#define _PR1_CS2_LENGTH                                     0x1
#define _PR1_CS2_MASK                                       0x4
#define _PR1_CS3_POSN                                       0x3
#define _PR1_CS3_POSITION                                   0x3
#define _PR1_CS3_SIZE                                       0x1
#define _PR1_CS3_LENGTH                                     0x1
#define _PR1_CS3_MASK                                       0x8

// Register: TMR0L
#define TMR0L TMR0L
extern volatile unsigned char           TMR0L               __at(0xFD2);
#ifndef _LIB_BUILD
asm("TMR0L equ 0FD2h");
#endif
// aliases
extern volatile unsigned char           TMR0                __at(0xFD2);
#ifndef _LIB_BUILD
asm("TMR0 equ 0FD2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0L                  :8;
    };
    struct {
        unsigned TMR0L0                 :1;
        unsigned TMR0L1                 :1;
        unsigned TMR0L2                 :1;
        unsigned TMR0L3                 :1;
        unsigned TMR0L4                 :1;
        unsigned TMR0L5                 :1;
        unsigned TMR0L6                 :1;
        unsigned TMR0L7                 :1;
    };
} TMR0Lbits_t;
